Repository: zhangchi0104/agent-sessions
Catalog: apps/TokenStats/TokenStats/Localizable.xcstrings
Source language: en
Languages: de, fr, ja, ru, zh_hans

# settings.appearance.title
source: Appearance
de: Erscheinungsbild
fr: Apparence
ja: 外観
ru: Оформление
zh_hans: 外观

# settings.appearance.token_summary.footer
source: Billing tokens count direct input and output. API equivalent estimates standard list-price cost from the Models recorded in local transcripts. Token Kind filters change neither summary.
de: Abrechnungs-Token umfassen direkte Eingaben und Ausgaben. Das API-Äquivalent schätzt die Kosten zu Standardlistenpreisen anhand der Modelle in lokalen Transkripten. Filter für Token-Typen ändern keine der beiden Zusammenfassungen.
fr: Les tokens facturables comprennent les entrées directes et les sorties. L’équivalent API estime le coût au tarif public standard à partir des modèles enregistrés dans les transcriptions locales. Les filtres de type de token ne modifient aucun de ces résumés.
ja: 課金対象トークンには、直接入力と出力が含まれます。API 換算額は、ローカルの会話記録に記録されたモデルの標準定価から費用を推定します。トークン種別フィルタは、どちらの概要にも影響しません。
ru: Расчётные токены включают прямой ввод и вывод. Эквивалент API оценивает стоимость по стандартным ценам на основе моделей из локальных журналов. Фильтры типов токенов не влияют ни на один из итогов.
zh_hans: 计费 Token 包含直接输入和输出。API 等值费用根据本地对话记录中的模型，按标准公开价格进行估算。Token 类型筛选不会改变任一摘要。

# settings.appearance.token_summary.title
source: Tokens summary
de: Token-Zusammenfassung
fr: Résumé des tokens
ja: トークン概要
ru: Итог по токенам
zh_hans: Token 摘要

# settings.appearance.token_value.percentage
source: Percentage
de: Prozentsatz
fr: Pourcentage
ja: 割合
ru: Процент
zh_hans: 百分比

# settings.appearance.token_value.value
source: Value
de: Wert
fr: Valeur
ja: 値
ru: Значение
zh_hans: 数值

# settings.appearance.token_value.value_and_percentage
source: Value (percentage)
de: Wert (Prozentsatz)
fr: Valeur (pourcentage)
ja: 値（割合）
ru: Значение (процент)
zh_hans: 数值（百分比）

# settings.appearance.token_values.footer
source: Enabled Token Kinds use this format. Disabled kinds keep a dimmed raw value and are excluded from composition percentages.
de: Aktivierte Token-Typen verwenden dieses Format. Deaktivierte Typen behalten einen ausgegrauten Rohwert und werden bei den prozentualen Anteilen nicht berücksichtigt.
fr: Les types de token activés utilisent ce format. Les types désactivés conservent une valeur brute estompée et sont exclus des pourcentages de composition.
ja: 有効なトークン種別にはこの形式を使用します。無効な種別は元の値を薄く表示し、構成比には含めません。
ru: Включённые типы токенов используют этот формат. Для отключённых типов сохраняется приглушённое исходное значение, и они не учитываются при расчёте процентного состава.
zh_hans: 启用的 Token 类型使用此格式。停用的类型保留灰显的原始数值，并从构成百分比中排除。

# settings.appearance.token_values.title
source: Token values
de: Token-Werte
fr: Valeurs des tokens
ja: トークン値
ru: Значения токенов
zh_hans: Token 数值

# settings.appearance.usage_window_style.footer
source: Choose how each Usage Window is drawn.
de: Wählen Sie, wie jeder Nutzungszeitraum dargestellt wird.
fr: Choisissez le mode d’affichage de chaque fenêtre d’utilisation.
ja: 各使用期間の表示方法を選択します。
ru: Выберите способ отображения каждого периода использования.
zh_hans: 选择各个用量周期的显示方式。

# settings.appearance.usage_window_style.picker
source: Display mode
de: Darstellungsmodus
fr: Mode d’affichage
ja: 表示モード
ru: Режим отображения
zh_hans: 显示方式

# settings.appearance.usage_window_style.section
source: Usage Window style
de: Darstellung der Nutzungszeiträume
fr: Style de fenêtre d’utilisation
ja: 使用期間のスタイル
ru: Стиль периода использования
zh_hans: 用量周期样式

# settings.appearance.visibility.agent.column
source: Agent
de: Coding Agent
fr: Coding Agent
ja: Coding Agent
ru: Coding Agent
zh_hans: Coding Agent

# settings.appearance.visibility.footer
source: Each row is an agent. Choose the surfaces where it appears; Tokens excludes unchecked agents from all summaries and totals. At least one agent must remain visible in each column.
de: Jede Zeile entspricht einem Coding Agent. Wählen Sie die Bereiche, in denen er angezeigt wird; unter „Token“ werden nicht ausgewählte Coding Agents aus allen Zusammenfassungen und Summen ausgeschlossen. In jeder Spalte muss mindestens ein Coding Agent sichtbar bleiben.
fr: Chaque ligne correspond à un Coding Agent. Choisissez les emplacements où il apparaît ; dans Tokens, les Coding Agents décochés sont exclus de tous les résumés et totaux. Au moins un Coding Agent doit rester visible dans chaque colonne.
ja: 各行は1つの Coding Agent です。表示する場所を選択してください。「トークン」のチェックを外すと、その Coding Agent はすべての概要と合計から除外されます。各列には少なくとも1つの Coding Agent を表示する必要があります。
ru: Каждая строка — Coding Agent. Выберите, где он отображается; снятие флажка «Токены» исключает Coding Agent из всех итогов и сумм. В каждом столбце должен оставаться хотя бы один видимый Coding Agent.
zh_hans: 每行代表一个 Coding Agent。选择它要显示的位置；取消勾选后，该 Coding Agent 将从 Token 页的所有摘要和合计中排除。每列至少要保留一个可见的 Coding Agent。

# settings.appearance.visibility.hidden.accessibility_value
source: Hidden
de: Ausgeblendet
fr: Masqué
ja: 非表示
ru: Скрыт
zh_hans: 已隐藏

# settings.appearance.visibility.menu_bar.accessibility_label
source: %@, menu bar visibility
de: %@, Sichtbarkeit in der Menüleiste
fr: %@, visibilité dans la barre des menus
ja: %@、メニューバーでの表示
ru: %@, отображение в строке меню
zh_hans: %@，菜单栏可见性

# settings.appearance.visibility.menu_bar.column
source: Menu bar
de: Menüleiste
fr: Barre des menus
ja: メニューバー
ru: Строка меню
zh_hans: 菜单栏

# settings.appearance.visibility.menu_bar.hide.help
source: Hide %@ from the menu bar
de: %@ in der Menüleiste ausblenden
fr: Masquer %@ dans la barre des menus
ja: メニューバーで %@ を非表示
ru: Не показывать %@ в строке меню
zh_hans: 在菜单栏中隐藏 %@

# settings.appearance.visibility.menu_bar.show.help
source: Show %@ in the menu bar
de: %@ in der Menüleiste anzeigen
fr: Afficher %@ dans la barre des menus
ja: メニューバーに %@ を表示
ru: Показывать %@ в строке меню
zh_hans: 在菜单栏中显示 %@

# settings.appearance.visibility.minimum.accessibility_hint
source: At least one agent must remain visible.
de: Mindestens ein Coding Agent muss sichtbar bleiben.
fr: Au moins un Coding Agent doit rester visible.
ja: 少なくとも1つの Coding Agent を表示する必要があります。
ru: Должен оставаться хотя бы один видимый Coding Agent.
zh_hans: 至少要保留一个可见的 Coding Agent。

# settings.appearance.visibility.section
source: Agent visibility
de: Sichtbarkeit der Coding Agents
fr: Visibilité des Coding Agents
ja: Coding Agent の表示
ru: Видимость Coding Agent
zh_hans: Coding Agent 可见性

# settings.appearance.visibility.shown.accessibility_value
source: Shown
de: Eingeblendet
fr: Affiché
ja: 表示中
ru: Показан
zh_hans: 已显示

# settings.appearance.visibility.tokens.accessibility_label
source: %@, Tokens visibility
de: %@, Sichtbarkeit unter „Token“
fr: %@, visibilité dans Tokens
ja: %@、「トークン」での表示
ru: %@, отображение в разделе «Токены»
zh_hans: %@，Token 页可见性

# settings.appearance.visibility.tokens.column
source: Tokens
de: Token
ja: トークン
ru: Токены
zh_hans: Token

# settings.appearance.visibility.tokens.hide.help
source: Hide %@ from Tokens and its totals
de: %@ unter „Token“ ausblenden und aus den zugehörigen Summen ausschließen
fr: Masquer %@ dans Tokens et ses totaux
ja: %@ を「トークン」とその合計から除外
ru: Не показывать %@ в разделе «Токены» и не учитывать в его итогах
zh_hans: 从 Token 页及其合计中隐藏 %@

# settings.appearance.visibility.tokens.show.help
source: Show %@ in Tokens and its totals
de: %@ unter „Token“ anzeigen und in die zugehörigen Summen einbeziehen
fr: Afficher %@ dans Tokens et ses totaux
ja: %@ を「トークン」とその合計に含める
ru: Показывать %@ в разделе «Токены» и его итогах
zh_hans: 在 Token 页及其合计中显示 %@

# settings.appearance.visibility.usage.accessibility_label
source: %@, Usage visibility
de: %@, Sichtbarkeit unter „Nutzung“
fr: %@, visibilité dans Utilisation
ja: %@、「使用状況」での表示
ru: %@, отображение в разделе «Использование»
zh_hans: %@，用量页可见性

# settings.appearance.visibility.usage.column
source: Usage
de: Nutzung
fr: Utilisation
ja: 使用状況
ru: Использование
zh_hans: 用量

# settings.appearance.visibility.usage.hide.help
source: Hide %@ from Usage
de: %@ unter „Nutzung“ ausblenden
fr: Masquer %@ dans Utilisation
ja: 「使用状況」で %@ を非表示
ru: Не показывать %@ в разделе «Использование»
zh_hans: 从用量页中隐藏 %@

# settings.appearance.visibility.usage.show.help
source: Show %@ in Usage
de: %@ unter „Nutzung“ anzeigen
fr: Afficher %@ dans Utilisation
ja: 「使用状況」に %@ を表示
ru: Показывать %@ в разделе «Использование»
zh_hans: 在用量页中显示 %@

# settings.general.language.footer
source: Language changes apply to TokenStats after it restarts. Numbers, dates, and USD amounts continue to use your Mac's regional formats.
de: Sprachänderungen werden nach einem Neustart von TokenStats angewendet. Zahlen, Datumsangaben und USD-Beträge verwenden weiterhin die regionalen Formate Ihres Mac.
fr: Les changements de langue s’appliquent à TokenStats après son redémarrage. Les nombres, les dates et les montants en USD continuent d’utiliser les formats régionaux de votre Mac.
ja: 言語の変更は TokenStats の再起動後に適用されます。数値、日付、米ドル金額には引き続き Mac の地域形式が使用されます。
ru: Изменение языка TokenStats применяется после перезапуска. Форматы чисел, дат и сумм в долларах США по-прежнему определяются региональными настройками Mac.
zh_hans: 语言更改将在 TokenStats 重启后生效。数字、日期和美元金额仍使用 Mac 的地区格式。

# settings.general.language.option.system
source: Follow System
de: Systemeinstellung verwenden
fr: Suivre le système
ja: システム設定に従う
ru: Как в системе
zh_hans: 跟随系统

# settings.general.language.restart.deferred
source: The new language will be applied the next time TokenStats starts.
de: Die neue Sprache wird beim nächsten Start von TokenStats verwendet.
fr: La nouvelle langue sera appliquée au prochain démarrage de TokenStats.
ja: 次回 TokenStats を起動したときに新しい言語が適用されます。
ru: Новый язык будет применён при следующем запуске TokenStats.
zh_hans: TokenStats 下次启动时将使用新语言。

# settings.general.language.restart.error.application_unavailable
source: TokenStats could not locate its application. Quit and reopen it manually.
de: TokenStats konnte die zugehörige App nicht finden. Beenden Sie TokenStats und öffnen Sie die App manuell erneut.
fr: TokenStats n’a pas pu localiser l’app à redémarrer. Quittez TokenStats et rouvrez l’app manuellement.
ja: TokenStats アプリが見つかりませんでした。手動で終了して、もう一度開いてください。
ru: Не удалось определить расположение приложения TokenStats. Завершите TokenStats и откройте приложение снова вручную.
zh_hans: TokenStats 无法定位应用程序。请手动退出并重新打开。

# settings.general.language.restart.error.launch_failed
source: TokenStats could not restart. This instance is still running.
de: TokenStats konnte nicht neu gestartet werden. Diese Instanz wird weiterhin ausgeführt.
fr: TokenStats n’a pas pu redémarrer. Cette instance est toujours en cours d’exécution.
ja: TokenStats を再起動できませんでした。このインスタンスは引き続き実行中です。
ru: Не удалось перезапустить TokenStats. Этот экземпляр продолжает работать.
zh_hans: TokenStats 无法重启。当前实例仍在运行。

# settings.general.language.restart.in_progress
source: Restarting TokenStats
de: TokenStats wird neu gestartet
fr: Redémarrage de TokenStats
ja: TokenStats を再起動中
ru: Перезапуск TokenStats
zh_hans: 正在重启 TokenStats

# settings.general.language.restart.later
source: Later
de: Später
fr: Plus tard
ja: 後で
ru: Позже
zh_hans: 稍后

# settings.general.language.restart.message
source: Restart TokenStats now to apply the new language, or continue using the current language until later.
de: Starten Sie TokenStats jetzt neu, um die neue Sprache anzuwenden, oder verwenden Sie bis zu einem späteren Neustart weiterhin die aktuelle Sprache.
fr: Redémarrez TokenStats maintenant pour appliquer la nouvelle langue, ou continuez à utiliser la langue actuelle et redémarrez plus tard.
ja: 新しい言語を適用するには TokenStats を今すぐ再起動してください。または、現在の言語を使い続けて後で再起動できます。
ru: Перезапустите TokenStats сейчас, чтобы применить новый язык, или продолжайте использовать текущий язык и перезапустите позже.
zh_hans: 立即重启 TokenStats 以应用新语言，或继续使用当前语言并稍后重启。

# settings.general.language.restart.now
source: Restart Now
de: Jetzt neu starten
fr: Redémarrer maintenant
ja: 今すぐ再起動
ru: Перезапустить сейчас
zh_hans: 立即重启

# settings.general.language.restart.section
source: Restart Required
de: Neustart erforderlich
fr: Redémarrage requis
ja: 再起動が必要です
ru: Требуется перезапуск
zh_hans: 需要重启

# settings.general.language.section
source: Language
de: Sprache
fr: Langue
ja: 言語
ru: Язык
zh_hans: 语言

# settings.general.language.title
source: App language
de: App-Sprache
fr: Langue de l’app
ja: アプリの言語
ru: Язык приложения
zh_hans: 应用语言

# settings.general.title
source: General
de: Allgemein
fr: Général
ja: 一般
ru: Основные
zh_hans: 通用

# settings.display.title
source: Display
de: Anzeige
fr: Affichage
ja: 表示
ru: Отображение
zh_hans: 显示

# settings.tokens.currency.section.title
source: API-equivalent currency
de: Währung des API-Äquivalents
fr: Devise de l’équivalent API
ja: API 換算額の表示通貨
ru: Валюта эквивалента API
zh_hans: API 等值费用货币

# settings.tokens.currency.display.label
source: Display currency
de: Anzeigewährung
fr: Devise d’affichage
ja: 表示通貨
ru: Валюта отображения
zh_hans: 显示货币

# settings.tokens.currency.display.help
source: Choose the currency used for API-equivalent estimates
de: Währung für Schätzungen des API-Äquivalents auswählen
fr: Choisir la devise utilisée pour les estimations de l’équivalent API
ja: API 換算額の推定に使用する通貨を選択します
ru: Выберите валюту для оценок эквивалента API
zh_hans: 选择 API 等值费用估算所使用的货币

# settings.tokens.currency.display.accessibility_label
source: Display currency, %@
de: Anzeigewährung, %@
fr: Devise d’affichage, %@
ja: 表示通貨：%@
ru: Валюта отображения: %@
zh_hans: 显示货币：%@

# settings.tokens.currency.details.expand.accessibility_hint
source: Expand exchange-rate details
de: Wechselkursdetails ausklappen
fr: Développer les détails des taux de change
ja: 為替レートの詳細を展開します
ru: Развернуть сведения о курсе валют
zh_hans: 展开汇率详情

# settings.tokens.currency.details.collapse.accessibility_hint
source: Collapse exchange-rate details
de: Wechselkursdetails einklappen
fr: Réduire les détails des taux de change
ja: 為替レートの詳細を折りたたみます
ru: Свернуть сведения о курсе валют
zh_hans: 收起汇率详情

# settings.tokens.currency.details.title
source: Exchange rate details
de: Wechselkursdetails
fr: Détails des taux de change
ja: 為替レートの詳細
ru: Сведения о курсе валют
zh_hans: 汇率详情

# settings.tokens.currency.details.reference_rate.label
source: Reference rate
de: Referenzkurs
fr: Taux de référence
ja: 参照レート
ru: Справочный курс
zh_hans: 参考汇率

# settings.tokens.currency.details.rate_date.label
source: Rate date
de: Kursdatum
fr: Date du taux
ja: レート日
ru: Дата курса
zh_hans: 报价日期

# settings.tokens.currency.details.fetched.label
source: Fetched
de: Abgerufen
fr: Récupération
ja: 取得日時
ru: Получено
zh_hans: 获取时间

# settings.tokens.currency.details.next_eligible_refresh.label
source: Next eligible refresh
de: Nächste mögliche Aktualisierung
fr: Prochaine actualisation autorisée
ja: 次に自動更新できる日時
ru: Следующее доступное обновление
zh_hans: 下次可自动刷新

# settings.tokens.currency.details.rate_provider.label
source: Rate provider
de: Kursanbieter
fr: Fournisseur de taux
ja: レートプロバイダ
ru: Поставщик курсов
zh_hans: 汇率提供商

# settings.tokens.currency.details.rate_provider.change.help
source: Change the exchange-rate provider or API endpoint
de: Wechselkursanbieter oder API-Endpunkt ändern
fr: Changer de fournisseur de taux de change ou de point de terminaison de l’API
ja: 為替レートのプロバイダまたは API エンドポイントを変更します
ru: Изменить поставщика курсов или конечную точку API
zh_hans: 更改汇率提供商或 API 端点

# settings.tokens.currency.details.rate_provider.change.accessibility_label
source: Rate provider, %@. Change provider or endpoint.
de: Kursanbieter, %@. Anbieter oder Endpunkt ändern.
fr: Fournisseur de taux, %@. Changer de fournisseur ou de point de terminaison.
ja: レートプロバイダ：%@。プロバイダまたはエンドポイントを変更します。
ru: Поставщик курсов: %@. Изменить поставщика или конечную точку.
zh_hans: 汇率提供商：%@。更改提供商或端点。

# settings.tokens.currency.details.api_endpoint.label
source: API endpoint
de: API-Endpunkt
fr: Point de terminaison de l’API
ja: API エンドポイント
ru: Конечная точка API
zh_hans: API 端点

# settings.tokens.currency.details.api_endpoint.change.accessibility_label
source: Exchange-rate API endpoint, %@. Change provider or endpoint.
de: API-Endpunkt für Wechselkurse, %@. Anbieter oder Endpunkt ändern.
fr: Point de terminaison de l’API de taux de change, %@. Changer de fournisseur ou de point de terminaison.
ja: 為替レート API エンドポイント：%@。プロバイダまたはエンドポイントを変更します。
ru: Конечная точка API курсов валют: %@. Изменить поставщика или конечную точку.
zh_hans: 汇率 API 端点：%@。更改提供商或端点。

# settings.tokens.currency.details.attribution.label
source: Attribution
de: Quellenangabe
ja: 帰属表示
ru: Источник данных
zh_hans: 来源标注

# settings.tokens.currency.details.request_policy
source: Official Model prices remain in USD. TokenStats downloads a complete USD reference-rate table from the selected provider automatically at most once every 24 hours. Retrying after an error sends one additional request.
de: Die offiziellen Modellpreise bleiben in USD. TokenStats lädt höchstens einmal alle 24 Stunden automatisch eine vollständige USD-Referenzkurstabelle vom ausgewählten Anbieter herunter. Bei einem erneuten Versuch nach einem Fehler wird eine zusätzliche Anfrage gesendet.
fr: Les tarifs officiels des modèles restent libellés en USD. TokenStats télécharge automatiquement une table complète de taux de référence basés sur l’USD auprès du fournisseur sélectionné, au maximum une fois toutes les 24 heures. Réessayer après une erreur envoie une requête supplémentaire.
ja: 公式のモデル価格は引き続き USD 建てです。TokenStats は、選択したプロバイダから USD 基準の完全な為替レート表を24時間に最大1回、自動的にダウンロードします。エラー後に再試行すると、追加のリクエストが1回送信されます。
ru: Официальные цены моделей остаются в USD. TokenStats автоматически загружает у выбранного поставщика полную таблицу справочных курсов относительно USD не чаще одного раза в 24 часа. Повторная попытка после ошибки отправляет один дополнительный запрос.
zh_hans: 官方模型价格仍以 USD 计价。TokenStats 每 24 小时最多自动从所选提供商下载一次完整的 USD 参考汇率表。发生错误后重试会额外发送一次请求。

# settings.tokens.currency.status.updating_rates
source: Updating rates…
de: Kurse werden aktualisiert…
fr: Actualisation des taux…
ja: 為替レートを更新中…
ru: Обновление курсов…
zh_hans: 正在更新汇率…

# settings.tokens.currency.status.loading_rates
source: Loading exchange rates…
de: Wechselkurse werden geladen…
fr: Chargement des taux de change…
ja: 為替レートを読み込み中…
ru: Загрузка курсов валют…
zh_hans: 正在加载汇率…

# settings.tokens.currency.status.refreshing_with_last_known
source: Refreshing rates; the last known rate remains in use.
de: Die Kurse werden aktualisiert; der zuletzt bekannte Kurs bleibt in Verwendung.
fr: Les taux sont en cours d’actualisation ; le dernier taux connu reste utilisé.
ja: 為替レートを更新中です。前回取得したレートを引き続き使用します。
ru: Курсы обновляются; используется последний известный курс.
zh_hans: 正在刷新汇率；仍继续使用上次已知汇率。

# settings.tokens.currency.status.retry_without_cache
source: Retry now to request rates again. This sends one additional request before the next scheduled update.
de: Versuchen Sie es jetzt erneut, um die Kurse erneut anzufordern. Dadurch wird vor der nächsten geplanten Aktualisierung eine zusätzliche Anfrage gesendet.
fr: Réessayez maintenant pour demander de nouveau les taux. Cela envoie une requête supplémentaire avant la prochaine actualisation planifiée.
ja: 今すぐ再試行すると、レートを再度リクエストします。これにより、次回の予定更新前に追加のリクエストが1回送信されます。
ru: Повторите попытку сейчас, чтобы снова запросить курсы. До следующего планового обновления будет отправлен один дополнительный запрос.
zh_hans: 立即重试以再次请求汇率。这会在下次计划更新前额外发送一次请求。

# settings.tokens.currency.status.retry_with_cache
source: The last known rate remains in use. Retry now to request rates again; this sends one additional request before the next scheduled update.
de: Der zuletzt bekannte Kurs bleibt in Verwendung. Versuchen Sie es jetzt erneut, um die Kurse erneut anzufordern; dadurch wird vor der nächsten geplanten Aktualisierung eine zusätzliche Anfrage gesendet.
fr: Le dernier taux connu reste utilisé. Réessayez maintenant pour demander de nouveau les taux ; cela envoie une requête supplémentaire avant la prochaine actualisation planifiée.
ja: 前回取得したレートを引き続き使用します。今すぐ再試行するとレートを再度リクエストし、次回の予定更新前に追加のリクエストが1回送信されます。
ru: Используется последний известный курс. Повторите попытку сейчас, чтобы снова запросить курсы; до следующего планового обновления будет отправлен один дополнительный запрос.
zh_hans: 仍继续使用上次已知汇率。立即重试可再次请求汇率；这会在下次计划更新前额外发送一次请求。

# settings.tokens.currency.status.stale_warning
source: The cached exchange rate may be out of date.
de: Der zwischengespeicherte Wechselkurs ist möglicherweise veraltet.
fr: Le taux de change en cache est peut-être obsolète.
ja: キャッシュされた為替レートは古い可能性があります。
ru: Курс в кэше может быть устаревшим.
zh_hans: 缓存汇率可能已过期。

# settings.tokens.currency.status.fallback_warning
source: %@ is unavailable; showing USD fallback.
de: %@ ist nicht verfügbar; USD wird ersatzweise angezeigt.
fr: %@ n’est pas disponible ; repli sur l’USD.
ja: %@ は利用できないため、USD にフォールバックして表示します。
ru: Валюта %@ недоступна; отображается резервное значение в USD.
zh_hans: %@ 不可用；当前回退显示 USD。

# settings.tokens.currency.status.unavailable_warning
source: %@ is unavailable; showing USD.
de: %@ ist nicht verfügbar; USD wird angezeigt.
fr: %@ n’est pas disponible ; l’USD est affiché.
ja: %@ は利用できないため、USD で表示します。
ru: Валюта %@ недоступна; отображается USD.
zh_hans: %@ 不可用；当前显示 USD。

# settings.tokens.currency.status.using_last_known
source: Using the last known reference rate.
de: Der zuletzt bekannte Referenzkurs wird verwendet.
fr: Le dernier taux de référence connu est utilisé.
ja: 前回取得した参照レートを使用しています。
ru: Используется последний известный справочный курс.
zh_hans: 正在使用上次已知参考汇率。

# settings.tokens.currency.status.no_rates_instruction
source: No exchange rates are cached yet. Refresh rates to load more currencies.
de: Es sind noch keine Wechselkurse zwischengespeichert. Aktualisieren Sie die Kurse, um weitere Währungen zu laden.
fr: Aucun taux de change n’est encore en cache. Actualisez les taux pour charger d’autres devises.
ja: 為替レートはまだキャッシュされていません。「レートを更新」を選んで、その他の通貨を読み込んでください。
ru: В кэше пока нет курсов валют. Обновите курсы, чтобы загрузить дополнительные валюты.
zh_hans: 尚未缓存汇率。请刷新汇率以加载更多货币。

# settings.tokens.currency.refresh.updating.button
source: Updating…
de: Aktualisierung…
fr: Actualisation…
ja: 更新中…
ru: Обновление…
zh_hans: 正在更新…

# settings.tokens.currency.refresh.updating.accessibility_label
source: Exchange rates are updating
de: Die Wechselkurse werden aktualisiert
fr: Les taux de change sont en cours d’actualisation
ja: 為替レートを更新中です
ru: Курсы валют обновляются
zh_hans: 正在更新汇率

# settings.tokens.currency.refresh.retry.button
source: Retry now
de: Jetzt erneut versuchen
fr: Réessayer maintenant
ja: 今すぐ再試行
ru: Повторить сейчас
zh_hans: 立即重试

# settings.tokens.currency.refresh.retry.help
source: Retry now, even if the normal daily refresh is not yet eligible
de: Jetzt erneut versuchen, auch wenn die normale tägliche Aktualisierung noch nicht möglich ist
fr: Réessayer maintenant, même si l’actualisation quotidienne normale n’est pas encore autorisée
ja: 通常の1日1回の更新タイミング前でも、今すぐ再試行します
ru: Повторить сейчас, даже если время обычного ежедневного обновления еще не наступило
zh_hans: 立即重试，即使尚未到常规每日刷新时间

# settings.tokens.currency.refresh.refresh.button
source: Refresh rates
de: Kurse aktualisieren
fr: Actualiser les taux
ja: レートを更新
ru: Обновить курсы
zh_hans: 刷新汇率

# settings.tokens.currency.refresh.updated.button
source: Updated
de: Aktuell
fr: À jour
ja: 更新済み
ru: Обновлено
zh_hans: 今日已更新

# settings.tokens.currency.refresh.updated.accessibility_label
source: Exchange rates are up to date
de: Die Wechselkurse sind aktuell
fr: Les taux de change sont à jour
ja: 為替レートは最新です
ru: Курсы валют актуальны
zh_hans: 汇率已是最新

# settings.tokens.currency.reference_rate.unavailable
source: %@ rate unavailable — USD fallback
de: %@-Kurs nicht verfügbar — ersatzweise USD
fr: Taux %@ indisponible — repli sur USD
ja: %@ のレートは利用できません — USD にフォールバック
ru: Курс %@ недоступен — резервное значение в USD
zh_hans: %@ 汇率不可用 — 回退为 USD
